{
    "stories": [
        {
            "id": 1,
            "type": "donor",
            "title": "Moxesh Shah: 100+ Donations Strong",
            "name": "Moxesh Shah",
            "donationCount": 100,
            "donationType": "Blood & SDP",
            "yearsActive": 14,
            "location": "Ahmedabad",
            "date": "2024-12-01",
            "excerpt": "Regular donor and founder of LifeSavers United, Moxesh Shah has donated 100+ times and continues to save lives by connecting patients with donors.",
            "fullStory": "My journey as a blood donor began in 2008 during the Ahmedabad Serial Bomb Blast. That tragic day changed my life forever - witnessing the urgent need for blood donations inspired me to step forward and donate for the first time. From 2012 onwards, I became a regular donor, and what started as a single act of compassion has now grown to over 100 donations, including both whole blood and Single Donor Platelets (SDP). But donating blood myself wasn't enough - I wanted to create a system where no patient would ever have to struggle to find blood. That's why I founded LifeSavers United in 2023. The vision was simple yet powerful: create Gujarat's largest immediate blood donation network where no request goes unanswered. Today, we've built a community of thousands of registered donors, each one a potential lifesaver. We operate 24/7, responding to emergencies at any hour. I've personally coordinated hundreds of requests, from midnight emergencies to complex cases requiring rare blood groups. Every call I receive at 3 AM, every successful match, every grateful family, every life saved - it all reminds me why this work is so important. What drives me is knowing that somewhere, a child gets to celebrate another birthday, a mother gets to see her children grow up, or a young person gets a second chance at life - all because someone took 30 minutes to donate blood. We've also focused on education, conducting awareness camps in colleges, corporate offices, and communities to dispel myths about blood donation and encourage more people to join our cause. My message to everyone is simple: You don't need to be extraordinary to save lives. You just need to care. Every donation matters, every donor is a hero, and together, we're building a safety net that ensures no life is lost due to lack of blood.",
            "motivation": "No life should be lost due to lack of blood. Every donation is an opportunity to be someone's hero.",
            "image": "/imgs/Moxesh-Shah.jpg",
            "featured": true,
            "testimonial": "Donating blood is the easiest way to make the biggest impact. It costs nothing but saves everything."
        },
        {
            "id": 2,
            "type": "donor",
            "title": "From Silent Observer to Active Lifesaver",
            "name": "Nikunj Mistri",
            "donationCount": "Multiple",
            "donationType": "Blood & SDP",
            "yearsActive": 2,
            "location": "Ahmedabad",
            "date": "2025-06-23",
            "excerpt": "What began as a family emergency on Christmas 2023 transformed into a journey of giving back, ultimately leading to the creation of this website to amplify LifeSavers United's mission.",
            "fullStory": "December 25th, 2023 - a day that changed everything. My relative urgently needed 2 units of blood, and through a contact, I was connected with <a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>LifeSavers United</a>. Within hours, Moxesh Shah and the group had arranged both units. The efficiency and compassion of these donors left a deep impression on me. Moxesh invited me to join the group, and I accepted - but as a silent member. For 18 months, I watched from the sidelines. I saw people responding at all hours, donors rushing to hospitals, families expressing gratitude, lives being saved. Yet I did nothing. Fear, uncertainty, or perhaps just inertia kept me on the sidelines. Then came June 23rd, 2025. I reached out to Moxesh with a proposal: let's create a website (<a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>www.lifesaversunited.org</a>) for LifeSavers United. Our conversations opened my eyes to the bigger picture - his vision of expanding the donor network and creating a sustainable system to save more lives. His passion was contagious. Something shifted within me. I realized I had been inspired all along - I just hadn't acted on it. That's when I decided: I wouldn't just build a website (<a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>www.lifesaversunited.org</a>); I would become an active part of this movement. Since then, I've donated blood multiple times for different patients. Each donation has been profound. The first time, I thought about my relative on that Christmas day. The second time, I thought about all those months I spent watching while others helped. Now, every time I donate, I think about the person whose life might be saved because I took 30 minutes out of my day. I've gone from silent observer to active donor, from passive member to someone building tools to help this organization grow. This website (<a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>www.lifesaversunited.org</a>) isn't just about technology - it's about making it easier for more people to join this life-saving network and inspiring others the way I was inspired. To anyone on the fence about donating blood: I was you. I watched from the sidelines for 18 months. But when I finally took that step, I discovered the joy of giving is far greater than any fear. You don't need to be special to save lives. You just need to show up. Join us. Become a lifesaver.",
            "motivation": "I watched lives being saved for 18 months before I found the courage to join. Now I can't imagine not being part of this mission.",
            "image": "/imgs/Nikunj-Mistri.JPG",
            "featured": true,
            "testimonial": "From silent observer to active donor - LifeSavers United didn't just inspire me to give blood, it inspired me to give back in every way I can."
        },
        {
            "id": 3,
            "type": "donor",
            "title": "Turning Fear into Hope: A Journey of 16 Lifelines",
            "name": "Utsav Gupte",
            "donationCount": 16,
            "donationType": "Blood & SDP",
            "yearsActive": 3,
            "location": "Karamsad",
            "date": "2026-02-15",
            "excerpt": "On his 18th birthday, Utsav chose to make a difference instead of having a party. What started with fear and a 160/100 blood pressure reading became a lifelong mission of 16+ donations and advocacy.",
            "fullStory": "On my 18th birthday, I didn't want a party; I wanted to make a difference. I walked into the blood bank at Krushna Hospital, Karamsad, with a 51kg frame and a heart full of good intentions. But the mind is a funny thing—even though I wanted to help, my nerves took over. My blood pressure spiked to 160/100, fueled by the mystery of the unknown. The staff didn't turn me away. Instead, a kind technician took me behind the scenes, explaining the life-saving journey of a single blood bag. Two coffees, a packet of Parle-G, and some truly inspiring words from the team later, my fear faded. That day, I didn't just celebrate a birthday; I gave the gift of life for the very first time. What started as a nervous first step became a lifelong mission. Since that day, I have donated blood more than 16 times and completed my first SDP (Single Donor Platelet) donation. My journey took a pivotal turn when I met Moxesh Shah. He invited me to join <a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>LifeSavers United</a>, and I accepted without hesitation. Working alongside Moxeshbhai has taught me the most vital lesson in this mission: the power of a calm heart. I've learned to answer every emergency call with the same calmness and sympathy that the hospital staff once showed me. Today, I don't just donate blood; I advocate for the quiet strength it takes to show up for someone in their darkest hour.",
            "motivation": "Every donation is a chance to be the calm, compassionate presence that someone desperately needs in their darkest moment.",
            "image": "/imgs/Utsav-Gupte.png",
            "featured": true,
            "testimonial": "Fear is temporary, but the life you save is forever. Two coffees and a packet of Parle-G taught me that courage isn't the absence of fear—it's showing up anyway."
        },
        {
            "id": 4,
            "type": "donor",
            "title": "The Quiet Mission: 25 Donations and Counting",
            "name": "Naman Kothari",
            "donationCount": 25,
            "donationType": "Blood & SDP",
            "yearsActive": 0.6,
            "location": "Ahmedabad",
            "date": "2026-02-16",
            "excerpt": "While others celebrated adulthood differently, Naman marked his 18th birthday by donating blood. Since then, he's donated 25+ times with a clear goal: 100 donations by age 50.",
            "fullStory": "I started donating blood the day I turned 18. While others were celebrating adulthood in different ways, I chose to mark it by giving blood for the first time. That decision quietly shaped who I am. Since then, I've donated more than 25 times. I closely track every three-month cycle, and the moment I'm eligible again, I go back. Blood cannot be manufactured. It cannot be replaced by machines or technology. It can only come from one human being to another. I am not a doctor. I cannot perform surgeries or treat patients. But by donating blood, I can still help save lives. For me, it is the simplest and most powerful way an ordinary person can make an extraordinary difference. My goal is to cross 100 whole blood donations by the age of 50. Not for recognition, but for the quiet satisfaction of knowing that I did my part. I joined <a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>LifeSavers United</a> when a friend's father urgently needed blood. The team helped connect us with a donor within just a few hours, and that experience made me realize the incredible impact this community can have. Since joining, I've experienced firsthand how selfless and dedicated the members and volunteers are. Being part of this initiative has made me more aware of the importance of timely blood donation and how a small effort from one person can save lives. In a few words, LifeSavers United is an inspiring initiative where people come together with compassion and commitment to make a real difference in the lives of those in need.",
            "motivation": "Blood cannot be manufactured or replaced by technology. It can only come from one human being to another.",
            "image": "/imgs/Naman-Kothari.jpeg",
            "featured": true,
            "testimonial": "You don't need a medical degree to save lives, sometimes, you just need the courage to give."
        },
        {
            "id": 5,
            "type": "patient",
            "title": "A Patient's Gratitude: How LifeSavers United Stood by Me During Bypass Surgery",
            "name": "Ashish Trivedi",
            "donationCount": null,
            "donationType": "Whole Blood",
            "yearsActive": null,
            "location": "Ahmedabad",
            "date": "2026-02-25",
            "excerpt": "When I needed bypass surgery at EPIC Hospital, <a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>LifeSavers United</a> arranged blood within hours through a stranger's kindness, letting my family focus on what mattered most: my recovery.",
            "fullStory": "When I had to undergo bypass surgery at EPIC Hospital, it was a challenging and emotional time for me and my family. Along with preparing for the surgery, we were informed about the hospital policy requiring two bottles of blood to be arranged.\n\nMy daughter reached out to her friend Naman, and the request was immediately shared in the <a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>LifeSavers United</a> WhatsApp group. Within a very short time, Gopan bhai stepped forward and helped arrange the blood donation. I was deeply touched by the kindness and prompt support shown by someone who didn't even know me personally.\n\nBecause of this timely help, everything was managed smoothly, and my family could focus on my recovery without additional stress. What makes this experience even more meaningful is that I have been a regular blood donor myself.\n\nI have always believed that donating blood is a small act that can save lives, and this time, I experienced that truth personally.\n\n<a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>LifeSavers United</a> is truly a blessing for people in need. It is not just a group, but a community built on compassion and humanity. I will always remain grateful for the support I received during one of the most critical moments of my life.\n\nThank you once again, <a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>LifeSavers United</a>.",
            "motivation": "I have always believed that donating blood is a small act that can save lives, and this time, I experienced that truth personally.",
            "image": "/imgs/Ashish Trivedi.jpeg",
            "featured": true,
            "testimonial": "<a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>LifeSavers United</a> is not just a group, but a community built on compassion and humanity. I will always remain grateful for the support I received during one of the most critical moments of my life."
        }
    ],
    "stats": {
        "totalStories": 5,
        "totalLivesSaved": 0,
        "totalDonors": 4,
        "totalPatients": 1,
        "totalEmergencies": 0
    }
}