{
    "stories": [
        {
            "id": 1,
            "type": "donor",
            "title": "Moxesh Shah: 60+ Donations Strong",
            "name": "Moxesh Shah",
            "donationCount": 60,
            "donationType": "Blood & SDP",
            "yearsActive": 8,
            "location": "Ahmedabad",
            "date": "2024-12-01",
            "excerpt": "Regular donor and founder of LifeSavers United, Moxesh Shah has donated 60+ times and continues to save lives by connecting patients with donors.",
            "fullStory": "My journey as a blood donor began in 2015, and it has been the most fulfilling experience of my life. What started as a single donation has now grown to over 60 donations, including both whole blood and Single Donor Platelets (SDP). But donating blood myself wasn't enough - I wanted to create a system where no patient would ever have to struggle to find blood. That's why I founded LifeSavers United in 2023. The vision was simple yet powerful: create Gujarat's largest immediate blood donation network where no request goes unanswered. Today, we've built a community of thousands of registered donors, each one a potential lifesaver. We operate 24/7, responding to emergencies at any hour. I've personally coordinated hundreds of requests, from midnight emergencies to complex cases requiring rare blood groups. Every call I receive at 3 AM, every successful match, every grateful family, every life saved - it all reminds me why this work is so important. What drives me is knowing that somewhere, a child gets to celebrate another birthday, a mother gets to see her children grow up, or a young person gets a second chance at life - all because someone took 30 minutes to donate blood. We've also focused on education, conducting awareness camps in colleges, corporate offices, and communities to dispel myths about blood donation and encourage more people to join our cause. My message to everyone is simple: You don't need to be extraordinary to save lives. You just need to care. Every donation matters, every donor is a hero, and together, we're building a safety net that ensures no life is lost due to lack of blood.",
            "motivation": "No life should be lost due to lack of blood. Every donation is an opportunity to be someone's hero.",
            "image": "/imgs/Moxesh-Shah.jpg",
            "featured": true,
            "testimonial": "Donating blood is the easiest way to make the biggest impact. It costs nothing but saves everything."
        },
        {
            "id": 2,
            "type": "donor",
            "title": "From Silent Observer to Active Lifesaver",
            "name": "Nikunj Mistri",
            "donationCount": "Multiple",
            "donationType": "Blood & SDP",
            "yearsActive": 2,
            "location": "Ahmedabad",
            "date": "2025-06-23",
            "excerpt": "What began as a family emergency on Christmas 2023 transformed into a journey of giving back, ultimately leading to the creation of this website to amplify LifeSavers United's mission.",
            "fullStory": "December 25th, 2023 - a day that changed everything. My relative urgently needed 2 units of blood, and through a contact, I was connected with <a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>LifeSavers United</a>. Within hours, Moxesh Shah and the group had arranged both units. The efficiency and compassion of these donors left a deep impression on me. Moxesh invited me to join the group, and I accepted - but as a silent member. For 18 months, I watched from the sidelines. I saw people responding at all hours, donors rushing to hospitals, families expressing gratitude, lives being saved. Yet I did nothing. Fear, uncertainty, or perhaps just inertia kept me on the sidelines. Then came June 23rd, 2025. I reached out to Moxesh with a proposal: let's create a website (<a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>www.lifesaversunited.org</a>) for LifeSavers United. Our conversations opened my eyes to the bigger picture - his vision of expanding the donor network and creating a sustainable system to save more lives. His passion was contagious. Something shifted within me. I realized I had been inspired all along - I just hadn't acted on it. That's when I decided: I wouldn't just build a website (<a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>www.lifesaversunited.org</a>); I would become an active part of this movement. Since then, I've donated blood multiple times for different patients. Each donation has been profound. The first time, I thought about my relative on that Christmas day. The second time, I thought about all those months I spent watching while others helped. Now, every time I donate, I think about the person whose life might be saved because I took 30 minutes out of my day. I've gone from silent observer to active donor, from passive member to someone building tools to help this organization grow. This website (<a href='https://lifesaversunited.org/' target='_blank' class='text-primary font-semibold hover:underline'>www.lifesaversunited.org</a>) isn't just about technology - it's about making it easier for more people to join this life-saving network and inspiring others the way I was inspired. To anyone on the fence about donating blood: I was you. I watched from the sidelines for 18 months. But when I finally took that step, I discovered the joy of giving is far greater than any fear. You don't need to be special to save lives. You just need to show up. Join us. Become a lifesaver.",
            "motivation": "I watched lives being saved for 18 months before I found the courage to join. Now I can't imagine not being part of this mission.",
            "image": "/imgs/Nikunj-Mistri.jpg",
            "featured": true,
            "testimonial": "From silent observer to active donor - LifeSavers United didn't just inspire me to give blood, it inspired me to give back in every way I can."
        }
    ],
    "stats": {
        "totalStories": 2,
        "totalLivesSaved": 0,
        "totalDonors": 2,
        "totalPatients": 0,
        "totalEmergencies": 0
    }
}